import { Container } from "@/components/container";
import style from "./style.module.css";
import { Accordion } from "@/components/accordion";

const data = [
  {
    id: 1,
    title: "Хто може навчатися в Logos School?",
    description:
      "Не нашли ответа на свой вопрос? Напишите нам в соцсетях. Програма складається не просто враховуючи який сайт закінчив студент. А враховуючи його знання, бо останн.",
  },
  {
    id: 2,
    title: "Що треба для вступу?",
    description:
      "Не нашли ответа на свой вопрос? Напишите нам в соцсетях. Програма складається не просто враховуючи який сайт закінчив студент. А враховуючи його знання, бо останн.",
  },
  {
    id: 3,
    title: "Які документи потрібні для дистанційного навчання в школі?",
    description:
      "Не нашли ответа на свой вопрос? Напишите нам в соцсетях. Програма складається не просто враховуючи який сайт закінчив студент. А враховуючи його знання, бо останн.",
  },
  {
    id: 4,
    title: "Коли можна починати навчання?",
    description:
      "Не нашли ответа на свой вопрос? Напишите нам в соцсетях. Програма складається не просто враховуючи який сайт закінчив студент. А враховуючи його знання, бо останн.",
  },
  {
    id: 5,
    title: "Як можна подати документи, якщо живемо за кордоном?",
    description:
      "Не нашли ответа на свой вопрос? Напишите нам в соцсетях. Програма складається не просто враховуючи який сайт закінчив студент. А враховуючи його знання, бо останн.",
  },
  {
    id: 6,
    title: "Чи є у вас ліцензія?",
    description:
      "Не нашли ответа на свой вопрос? Напишите нам в соцсетях. Програма складається не просто враховуючи який сайт закінчив студент. А враховуючи його знання, бо останн.",
  },
  {
    id: 7,
    title: "Як проходять контрольні роботи і як часто?",
    description:
      "Не нашли ответа на свой вопрос? Напишите нам в соцсетях. Програма складається не просто враховуючи який сайт закінчив студент. А враховуючи його знання, бо останн.",
  },
  {
    id: 8,
    title: "Наскільки кваліфіковані ваші вчителі?",
    description:
      "Не нашли ответа на свой вопрос? Напишите нам в соцсетях. Програма складається не просто враховуючи який сайт закінчив студент. А враховуючи його знання, бо останн.",
  },
];
export function Answer() {
  return (
    <section className={style.answer}>
      <Container>
        <div className={style.answer__box}>
          <div className={style.answer__info}>
            <h3 className={style.answer__title}>
              Відповіді на популярні питання
            </h3>
            <p className={style.answer__description}>
              Не нашли ответа на свой вопрос? Напишите нам в соцсетях. Програма
              складається не просто враховуючи який сайт закінчив студент. А
              враховуючи його знання, бо останн.
            </p>
          </div>
          <ul className={style.list}>
            {data.map((item) => {
              return (
                <Accordion
                  title={item.title}
                  description={item.description}
                  key={item.id}
                />
              );
            })}
          </ul>
        </div>
      </Container>
    </section>
  );
}
